clientlib/src/test/resources/com/github/veithen/visualwas/client/pmi/invoke-setInstrumentationLevel-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Header xmlns:ns0="admin" ns0:JMXMessageVersion="1.2.0" ns0:JMXVersion="1.2.0">
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:invoke xmlns:ns1="urn:AdminService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<objectname xsi:type="ns1:javax.management.ObjectName">rO0ABXNyABtqYXZheC5tYW5hZ2VtZW50Lk9iamVjdE5hbWUPA6cb620VzwMAAHhwdACkV2ViU3BoZXJlOm5hbWU9UGVyZk1CZWFuLHByb2Nlc3M9c2VydmVyMSxwbGF0Zm9ybT1keW5hbWljcHJveHksbm9kZT1waG9ib3NOb2RlMDMsdmVyc2lvbj03LjAuMC4yNyx0eXBlPVBlcmYsbWJlYW5JZGVudGlmaWVyPVBlcmZNQmVhbixjZWxsPXBob2Jvc05vZGUwM0NlbGwsc3BlYz0xLjB4</objectname>
<operationname xsi:type="xsd:string">setInstrumentationLevel</operationname>
<params xsi:type="ns1:[Ljava.lang.Object;">rO0ABXVyABNbTGphdmEubGFuZy5PYmplY3Q7kM5YnxBzKWwCAAB4cAAAAAJ1cgArW0xjb20uaWJtLndlYnNwaGVyZS5wbWkuc3RhdC5TdGF0TGV2ZWxTcGVjO3ZnGe2s0upKAgAAeHAAAAABc3IAKGNvbS5pYm0ud2Vic3BoZXJlLnBtaS5zdGF0LlN0YXRMZXZlbFNwZWOvur6/mBmaHwIAAlsABmVuYWJsZXQAAltJWwAEcGF0aHQAE1tMamF2YS9sYW5nL1N0cmluZzt4cHVyAAJbSU26YCZ26rKlAgAAeHAAAAADAAAAAQAAAAIAAAADdXIAE1tMamF2YS5sYW5nLlN0cmluZzut0lbn6R17RwIAAHhwAAAAAnQAEHRocmVhZFBvb2xNb2R1bGV0AAxXZWJDb250YWluZXJzcgARamF2YS5sYW5nLkJvb2xlYW7NIHKA1Zz67gIAAVoABXZhbHVleHAA</params>
<signature xsi:type="ns1:[Ljava.lang.String;">rO0ABXVyABNbTGphdmEubGFuZy5TdHJpbmc7rdJW5+kde0cCAAB4cAAAAAJ0ACtbTGNvbS5pYm0ud2Vic3BoZXJlLnBtaS5zdGF0LlN0YXRMZXZlbFNwZWM7dAARamF2YS5sYW5nLkJvb2xlYW4=</signature>
</ns1:invoke>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
